Repository: abdallah21elshayeb/Fkretek-App-using-flutter-and-dart-and-firebase
Catalog: lib/l10n/app_*.arb
Languages: ar

# homePage
source: Fekretek
ar: فكرتك

source: Home
ar: الصفحة الرئيسية

source: tecnology
ar: تكنولوجي

source: service
ar: خدمي

source: commercial
ar: تجاري

source: industrial
ar: تصنيعي

# have
source: Do you have :
ar: هل لديك :

# idea1
source: Initial idea
ar: فكرة مبدئية

# idea2
source: Executed model
ar: نموذج تم تنفيذه

# idea3
source: Complete product or service
ar: منتج كامل او خدمة

# idea4
source: An existing company or entity
ar: شركة او كيان قائم

# personalInformation
source: Please enter your Data
ar: أدخل بياناتك

source: Name
ar: الأسم

# nameHint
source: Enter your name
ar: أدخل أسمك

# phone
source: Enter your phone
ar: أدخل رقم الهاتف

# idea
source: Enter your idea
ar: ضع فكرة المشروع

# image
source: Upload images
ar: أرفع الصور

source: Add image
ar: أضف صوره

# photoData
source: choose photo
ar: أختر الصور

source: Camera
ar: الكاميرا

source: Gallery
ar: المعرض

# sales
source: Indicate the sales volume (if it available)
ar: اذكر حجم المبيعات الشهرية(ان وجد)

# moreImages
source: Put your pictures here
ar: ضع الصور هنا

# moreFiles
source: Put your files here
ar: ضع الملفات هنا

# vision
source: company vision
ar: رؤية الشركة

# mission
source: company mission
ar: مهمة الشركة'

# goals
source: Strategic and tactical goals of the company
ar: اهداف الشركة الاستراتيجية والتكتيكية

# productDetails
source: Describe in detail the company's products or services
ar: اذكر بالتفصيل منتجات الشركة او الخدمات التي تقدمها

# errorName
source: Please Add Your Name!
ar: أضف أسمك!

# errorPhone
source: Please Add Phone!
ar: أضف رقم هاتفك!

# errorText
source: Please Add Text!
ar: أضف البيانات!

# errorEmail
source: Enter your email address!
ar: أدخل البريد الالكتروني!

# emailHint
source: Enter your email
ar: أدخل بريدك الالكتروني

source: Submit Info
ar: إرسال معلومات

source: About Us
ar: معلومات عنا

source: Settings
ar: الإعدادات

# fileName
source: Add a file
ar: أضف ملف

# ideaType1
source: What is the type of your idea?
ar: ما هي نوع فكرتك؟

# ideaType2
source: What is the type of your model?
ar: ما هو نوع منتجك؟

# ideaType3
source: What is the type of your service?
ar: ما هو نوع خدمتك؟

# ideaType4
source: What is the type of your company?
ar: ما هي نوع شركتك؟

source: Change Language
ar: تغيير اللغة

# langKey
source: Lang
ar: اللغة

# dreamButton
source: Start your dream
ar: ابدأ تحقيق حلمك

# thankful
source: Thank you for trusting us, and we will get back to you after deciding on your project
ar: شكرا لثقتكم بنا و سوف نرد عليك بعد البت في مشروعك

# elnorCompany
source: Noor Foundation Mission
ar: رسالة مؤسسة نور

# elnorCompanyMission
source: Is to transfer your dreams into reality
ar: أن تخرج فكرتك إلى النور

# intro1
source: We are here to help you make your dreams come true
ar: نحن هنا من أجل مساعدتك وتحقيق احلامك

# intro2
source: We will strive together to achieve your goal and implement your idea, and together we will transfer your ideas from dreams to reality
ar: سوف نسعي سويا لتحقيق وتنفيذ حلمك; وسوف نقوم سويا بتحويل حلمك من حبر على الورق إلى أرض الواقع
